app/controllers/amizades_controller.rb

    def resposta
        # byebug
        # @amizade = Amizade.new
        amigo2 = Usuario.find_by(id: params[:id])

        amizade1 = Amizade.new(usuario_id: amigo2.id)
        amizade2 = Amizade.new(usuario_id: @usuario.id)

        @usuario.amizades << amizade1
        amigo2.amizades << amizade2
---
SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
INSERT INTO "amizades" ("usuario_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["usuario_id", 6], ["created_at", "2019-06-28 12:42:47.170746"], ["updated_at", "2019-06-28 12:42:47.170746"]]
INSERT INTO "amizades" ("usuario_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["usuario_id", 6], ["created_at", "2019-06-28 12:42:47.184383"], ["updated_at", "2019-06-28 12:42:47.184383"]]