app/controllers/application_controller.rb

    def autenticar_usuario
        @usuario = Usuario.find_by( token: request.headers["token"]) rescue nil
---
SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."token" = ? LIMIT ?  [["token", "e5e0b7cb-f38c-4cf0-89cd-82db99cd25f3"], ["LIMIT", 1]]