app/controllers/curtirs_controller.rb

SELECT  "postagems".* FROM "postagems" WHERE "postagems"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "curtirs" ("postagem_id", "usuario_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["postagem_id", 1], ["usuario_id", 1], ["created_at", "2019-07-09 12:34:22.233388"], ["updated_at", "2019-07-09 12:34:22.233388"]]
---
  def curtir
    curtida = Curtir.new(usuario_id: @usuario.id, postagem_id: params[:id])
    postagem_curtida = Postagem.find_by(id: curtida.postagem_id)
    curtida.save!