app/controllers/postagems_controller.rb

INSERT INTO "postagems" ("mensagem", "usuario_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["mensagem", "ble"], ["usuario_id", 1], ["created_at", "2019-06-24 13:56:01.801007"], ["updated_at", "2019-06-24 13:56:01.801007"]]
---
    def create
        @postagem = Postagem.new(postagem_params)

        if @postagem.nil?
            return render json: "A postagem está em branco", status: 400
        else
            @usuario.postagems << @postagem

UPDATE "postagems" SET "mensagem" = ?, "updated_at" = ? WHERE "postagems"."id" = ?  [["mensagem", "bla"], ["updated_at", "2019-06-24 14:42:20.985240"], ["id", 10]]
---
    def update

        unless params[:mensagem].nil?
            @postagem.update(mensagem: params[:mensagem])

DELETE FROM "postagems" WHERE "postagems"."id" = ?  [["id", 10]]
---
    def destroy
            @postagem.destroy

SELECT "amizades".* FROM "amizades" WHERE "amizades"."usuario_id" = ?  [["usuario_id", 2]]
SELECT  "postagems".* FROM "postagems" WHERE "postagems"."usuario_id" IN (?, ?) ORDER BY "postagems"."created_at" DESC LIMIT ? OFFSET ?  [["usuario_id", 1], ["usuario_id", 2], ["LIMIT", 20], ["OFFSET", 0]]
SELECT  "postagems".* FROM "postagems" WHERE "postagems"."usuario_id" IN (?, ?) AND (unaccent(mensagem) Ilike unaccent('%%')) ORDER BY "postagems"."created_at" DESC LIMIT ? OFFSET ?  [["usuario_id", 1], ["usuario_id", 2], ["LIMIT", 20], ["OFFSET", 40]]
---
    def list
        lista_ids = Amizade.where(usuario_id: @usuario.id).map(&:id).uniq
        lista_ids << @usuario.id
        if params[:query].nil?
            @postagem = Postagem.where(usuario_id: lista_ids).order(created_at: :desc).page(params[:pagina]).per(20)
        else
            @postagem = Postagem.where(usuario_id: lista_ids).where(["mensagem LIKE ? OR mensagem LIKE ?", "%#{params[:query]}%", "%#{params[:query]}%"]).order(created_at: :desc).page(params[:pagina]).per(20)

SELECT  "postagems".* FROM "postagems" WHERE "postagems"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
---
    def set_postagem
        @postagem = Postagem.find_by(id: params[:id])