app/controllers/solicitacaos_controller.rb

INSERT INTO "solicitacaos" ("usuario_id", "solicitado_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["usuario_id", 5], ["solicitado_id", 5], ["created_at", "2019-06-26 16:45:42.812646"], ["updated_at", "2019-06-26 16:45:42.812646"]]
---
    def create

        if params[:id].nil? || params[:id] == @usuario.id.to_s
            return render json: "Solicitacao inválida.", status:400
        end
        solicitacao = Solicitacao.new(usuario_id: @usuario.id, solicitado_id: params[:id])
        solicitacao.save!

SELECT "solicitacaos".* FROM "solicitacaos" WHERE "solicitacaos"."usuario_id" = ?  [["usuario_id", 5]]
---
    def listar_solicitacoes_enviadas

        solicitacao = []
       @usuario.solicitacaos.each do |s|

SELECT "solicitacaos".* FROM "solicitacaos" WHERE "solicitacaos"."solicitado_id" = ?  [["solicitado_id", 5]]
---
    def listar_solicitacoes_recebidas
       solicitacao = []
       Solicitacao.where(solicitado_id: @usuario.id).each do |s|