app/controllers/usuarios_controller.rb

INSERT INTO "usuarios" ("nome", "username", "email", "password_digest", "token", "created_at", "updated_at", "foto_file_name", "foto_content_type", "foto_file_size", "foto_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        @usuario = Usuario.new(usuario_params)

        if !params[:nome].nil? && !params[:email].nil? && !params[:username].nil? && !params[:password].nil?

            @usuario.token = set_token
            if @usuario.save!

SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."email" = ? LIMIT ?  [["email", "alice.malzac@gmail.com"], ["LIMIT", 1]]
UPDATE "usuarios" SET "token" = ?, "updated_at" = ? WHERE "usuarios"."id" = ?  [["token", "13878f61-d7a8-4afb-9c1f-a9ad74aac063"], ["updated_at", "2019-06-24 13:47:43.332324"], ["id", 1]]
---
    def login
    # byebug
        @usuario = Usuario.find_by(email: params[:email])
        if @usuario.try(:authenticate, params[:password])
            @usuario.update!(token: set_token)

UPDATE "usuarios" SET "token" = ?, "updated_at" = ? WHERE "usuarios"."id" = ?  [["token", nil], ["updated_at", "2019-06-24 14:39:24.869325"], ["id", 4]]
---
    def logout
        @usuario.update!(token: nil)

UPDATE "usuarios" SET "password_digest" = ?, "updated_at" = ? WHERE "usuarios"."id" = ?  [["password_digest", "$2a$10$s90JFwubCBpYYKjE13f4PuCSVgvN/qOp2F3EoGI4TxeCnjtQvE2qG"], ["updated_at", "2019-06-24 14:40:09.857330"], ["id", 4]]
UPDATE "usuarios" SET "nome" = ?, "updated_at" = ? WHERE "usuarios"."id" = ?  [["nome", "Diego"], ["updated_at", "2019-06-24 14:40:09.865535"], ["id", 4]]
---
    def update
        nome = !params[:nome].nil? ? params[:nome] : @usuario.nome
        unless params[:password].nil?
            @usuario.password = params[:password]
            @usuario.save!
        end
       @usuario.update(nome: nome)